In [1]:
import pandas as pd

In [2]:
data_dirty = {
    "Customer_ID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],

    "Name": ["Amit", "Neha", None, "Rohit", "Pooja", None, "Karan", "Sneha", None, "Vikas"],

    "Age": [25, None, 30, 28, None, 35, 40, None, 27, 33],

    "Gender": ["Male", "Female", "Male", None, "Female", "Male", None, "Female", "Male", None],

    "City": ["Indore", None, "Bhopal", "Delhi", "Indore", "Mumbai", None, "Delhi", "Bhopal", None],

    "Signup_Date": ["2023-01-10", "2023-01-15", None, "2023-02-01", "2023-02-10", None, "2023-03-05", "2023-03-10", None, "2023-03-20"],

    "Monthly_Spend": [1200, 1500, None, 1800, 1600, None, 2000, 1700, None, 1900],

    "Visits_Per_Month": [5, None, 3, 4, None, 6, 7, None, 2, 5],

    "Satisfaction_Rating": [4, 5, None, 3, 4, None, 5, 4, None, 3],

    "Is_Premium_User": [True, None, False, True, None, False, True, None, False, True],

    "Feedback": ["Good service", None, "Average", "Nice staff", None, "Could improve", "Excellent", None, "Okay", None]
}

df = pd.DataFrame(data_dirty)
df

,Customer_ID,Name,Age,Gender,City,Signup_Date,Monthly_Spend,Visits_Per_Month,Satisfaction_Rating,Is_Premium_User,Feedback
0,101,Amit,25.0,Male,Indore,2023-01-10,1200.0,5.0,4.0,True,Good service
1,102,Neha,NaN,Female,None,2023-01-15,1500.0,NaN,5.0,None,None
2,103,None,30.0,Male,Bhopal,None,NaN,3.0,NaN,False,Average
3,104,Rohit,28.0,None,Delhi,2023-02-01,1800.0,4.0,3.0,True,Nice staff
4,105,Pooja,NaN,Female,Indore,2023-02-10,1600.0,NaN,4.0,None,None
5,106,None,35.0,Male,Mumbai,None,NaN,6.0,NaN,False,Could improve
6,107,Karan,40.0,None,None,2023-03-05,2000.0,7.0,5.0,True,Excellent
7,108,Sneha,NaN,Female,Delhi,2023-03-10,1700.0,NaN,4.0,None,None
8,109,None,27.0,Male,Bhopal,None,NaN,2.0,NaN,False,Okay
9,110,Vikas,33.0,None,None,2023-03-20,1900.0,5.0,3.0,True,None

In [4]:
df.isna().sum()

Customer_ID            0
Name                   3
Age                    3
Gender                 3
City                   3
Signup_Date            3
Monthly_Spend          3
Visits_Per_Month       3
Satisfaction_Rating    3
Is_Premium_User        3
Feedback               4
dtype: int64

In [11]:
df['Age'].mean()

df['Age'].fillna(df['Age'].mean(),inplace=True)
df

,Customer_ID,Name,Age,Gender,City,Signup_Date,Monthly_Spend,Visits_Per_Month,Satisfaction_Rating,Is_Premium_User,Feedback
0,101,Amit,25.000000,Male,Indore,2023-01-10,1200.0,5.0,4.0,True,Good service
1,102,Neha,31.142857,Female,None,2023-01-15,1500.0,NaN,5.0,None,None
2,103,None,30.000000,Male,Bhopal,None,NaN,3.0,NaN,False,Average
3,104,Rohit,28.000000,None,Delhi,2023-02-01,1800.0,4.0,3.0,True,Nice staff
4,105,Pooja,31.142857,Female,Indore,2023-02-10,1600.0,NaN,4.0,None,None
5,106,None,35.000000,Male,Mumbai,None,NaN,6.0,NaN,False,Could improve
6,107,Karan,40.000000,None,None,2023-03-05,2000.0,7.0,5.0,True,Excellent
7,108,Sneha,31.142857,Female,Delhi,2023-03-10,1700.0,NaN,4.0,None,None
8,109,None,27.000000,Male,Bhopal,None,NaN,2.0,NaN,False,Okay
9,110,Vikas,33.000000,None,None,2023-03-20,1900.0,5.0,3.0,True,None

In [17]:
df['City'].fillna('Indore',inplace=True)
df

,Customer_ID,Name,Age,Gender,City,Signup_Date,Monthly_Spend,Visits_Per_Month,Satisfaction_Rating,Is_Premium_User,Feedback
0,101,Amit,25.000000,Male,Indore,2023-01-10,1200.0,5.0,4.0,True,Good service
1,102,Neha,31.142857,Female,Indore,2023-01-15,1500.0,NaN,5.0,None,None
2,103,None,30.000000,Male,Bhopal,None,NaN,3.0,NaN,False,Average
3,104,Rohit,28.000000,None,Delhi,2023-02-01,1800.0,4.0,3.0,True,Nice staff
4,105,Pooja,31.142857,Female,Indore,2023-02-10,1600.0,NaN,4.0,None,None
5,106,None,35.000000,Male,Mumbai,None,NaN,6.0,NaN,False,Could improve
6,107,Karan,40.000000,None,Indore,2023-03-05,2000.0,7.0,5.0,True,Excellent
7,108,Sneha,31.142857,Female,Delhi,2023-03-10,1700.0,NaN,4.0,None,None
8,109,None,27.000000,Male,Bhopal,None,NaN,2.0,NaN,False,Okay
9,110,Vikas,33.000000,None,Indore,2023-03-20,1900.0,5.0,3.0,True,None

In [18]:
df['Monthly_Spend'].fillna(df['Monthly_Spend'].mean(),inplace=True)
df

C:\Users\Jash\AppData\Local\Temp\ipykernel_24784\648660821.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Monthly_Spend'].fillna(df['Monthly_Spend'].mean(),inplace=True)

,Customer_ID,Name,Age,Gender,City,Signup_Date,Monthly_Spend,Visits_Per_Month,Satisfaction_Rating,Is_Premium_User,Feedback
0,101,Amit,25.000000,Male,Indore,2023-01-10,1200.000000,5.0,4.0,True,Good service
1,102,Neha,31.142857,Female,Indore,2023-01-15,1500.000000,NaN,5.0,None,None
2,103,None,30.000000,Male,Bhopal,None,1671.428571,3.0,NaN,False,Average
3,104,Rohit,28.000000,None,Delhi,2023-02-01,1800.000000,4.0,3.0,True,Nice staff
4,105,Pooja,31.142857,Female,Indore,2023-02-10,1600.000000,NaN,4.0,None,None
5,106,None,35.000000,Male,Mumbai,None,1671.428571,6.0,NaN,False,Could improve
6,107,Karan,40.000000,None,Indore,2023-03-05,2000.000000,7.0,5.0,True,Excellent
7,108,Sneha,31.142857,Female,Delhi,2023-03-10,1700.000000,NaN,4.0,None,None
8,109,None,27.000000,Male,Bhopal,None,1671.428571,2.0,NaN,False,Okay
9,110,Vikas,33.000000,None,Indore,2023-03-20,1900.000000,5.0,3.0,True,None

In [24]:
df['Signup_Date'].ffill()

0    2023-01-10
1    2023-01-15
2    2023-01-15
3    2023-02-01
4    2023-02-10
5    2023-02-10
6    2023-03-05
7    2023-03-10
8    2023-03-10
9    2023-03-20
Name: Signup_Date, dtype: object